function change_node_id(val) {
	var list = eval( {
		"小学" : {
			"134" : "\u5e7c\u6559",
			"143" : "\u5c0f\u5b66\u5965\u6570",
			"100" : "\u5c0f\u5b66\u6570\u5b66",
			"102" : "\u5c0f\u5b66\u82f1\u8bed",
			"109" : "\u5c0f\u5b66\u8bed\u6587",
			"300" : "\u5c0f\u5b66\u966a\u8bfb",
			"542" : "\u661f\u7ea7\u82f1\u8bed",
			"242" : "\u966a\u73a9\u966a\u8bfb",
			"241" : "\u5b66\u524d\u6559\u80b2"
		},
		"初中" : {
			"186" : "\u521d\u4e2d\u5965\u6570",
			"110" : "\u521d\u4e00\u521d\u4e8c\u82f1\u8bed",
			"111" : "\u521d\u4e00\u521d\u4e8c\u6570\u5b66",
			"118" : "\u521d\u4e00\u521d\u4e8c\u5316\u5b66",
			"101" : "\u521d\u4e00\u521d\u4e8c\u7269\u7406",
			"129" : "\u521d\u4e00\u521d\u4e8c\u8bed\u6587",
			"112" : "\u521d\u4e09\u82f1\u8bed",
			"119" : "\u521d\u4e09\u6570\u5b66",
			"126" : "\u521d\u4e09\u7269\u7406",
			"120" : "\u521d\u4e09\u5316\u5b66",
			"130" : "\u521d\u4e09\u8bed\u6587",
			"164" : "\u521d\u4e2d\u5386\u53f2",
			"173" : "\u521d\u4e2d\u5730\u7406"
		},
		"高中" : {
			"114" : "\u9ad8\u4e00\u9ad8\u4e8c\u82f1\u8bed",
			"121" : "\u9ad8\u4e00\u9ad8\u4e8c\u6570\u5b66",
			"127" : "\u9ad8\u4e00\u9ad8\u4e8c\u7269\u7406",
			"122" : "\u9ad8\u4e00\u9ad8\u4e8c\u5316\u5b66",
			"115" : "\u9ad8\u4e09\u82f1\u8bed",
			"124" : "\u9ad8\u4e09\u6570\u5b66",
			"128" : "\u9ad8\u4e09\u7269\u7406",
			"125" : "\u9ad8\u4e09\u5316\u5b66",
			"135" : "\u9ad8\u4e09\u8bed\u6587",
			"156" : "\u9ad8\u4e2d\u5386\u53f2",
			"174" : "\u9ad8\u4e2d\u5730\u7406",
			"541" : "\u4fe1\u606f\u79d1\u6280",
			"543" : "\u7406\u7efc",
			"544" : "\u6587\u7efc"
		},
		"语言" : {
			"132" : "\u82f1\u8bed\u53e3\u8bed",
			"137" : "\u65b0\u6982\u5ff5\u82f1\u8bed",
			"154" : "\u725b\u6d25\u82f1\u8bed",
			"217" : "\u6258\u798f",
			"170" : "\u96c5\u601d",
			"171" : "\u5546\u52a1\u82f1\u8bed",
			"105" : "\u65e5\u8bed",
			"180" : "\u97e9\u8bed",
			"161" : "\u5fb7\u8bed",
			"175" : "\u6cd5\u8bed",
			"203" : "\u610f\u5927\u5229\u8bed",
			"155" : "\u897f\u73ed\u7259\u8bed",
			"236" : "\u963f\u62c9\u4f2f\u8bed",
			"225" : "\u5bf9\u5916\u6c49\u8bed",
			"244" : "sbs\u82f1\u8bed",
			"248" : "\u4fc4\u8bed",
			"346" : "\u8461\u8404\u7259\u8bed"
		},
		"音乐" : {
			"131" : "\u94a2\u7434",
			"144" : "\u7535\u5b50\u7434",
			"108" : "\u5c0f\u63d0\u7434",
			"224" : "\u5c0f\u53f7",
			"219" : "\u82ad\u857e\u821e",
			"213" : "\u5409\u4ed6",
			"209" : "\u6c11\u65cf\u821e",
			"197" : "\u5355\u7c27\u7ba1",
			"196" : "\u8428\u514b\u65af",
			"195" : "\u58f0\u4e50",
			"193" : "\u5927\u53f7",
			"182" : "\u89c6\u5531\u7ec3\u8033",
			"166" : "\u53e4\u7b5d",
			"159" : "\u624b\u98ce\u7434",
			"157" : "\u7435\u7436",
			"153" : "\u957f\u7b1b",
			"280" : "\u5706\u53f7",
			"274" : "\u6253\u51fb\u4e50",
			"273" : "\u5927\u63d0\u7434",
			"249" : "\u4e8c\u80e1",
			"240" : "\u53e4\u7434",
			"332" : "\u4e2d\u63d0\u7434"
		},
		"其他" : {
			"176" : "\u9ad8\u7b49\u6570\u5b66",
			"142" : "\u7f51\u7403",
			"141" : "\u4e52\u4e53\u7403",
			"140" : "\u6e38\u6cf3",
			"233" : "\u6cb9\u753b",
			"231" : "\u7d20\u63cf",
			"215" : "\u56f4\u68cb",
			"192" : "\u4e2d\u56fd\u753b",
			"179" : "\u56fd\u9645\u8c61\u68cb",
			"138" : "\u7fbd\u6bdb\u7403",
			"167" : "\u4e2d\u56fd\u8c61\u68cb",
			"160" : "\u5361\u901a\u753b",
			"158" : "\u4e66\u6cd5",
			"147" : "\u7f8e\u672f",
			"139" : "\u8dc6\u62f3\u9053",
			"261" : "\u6c34\u5f69",
			"265" : "\u6f2b\u753b",
			"279" : "\u7a7a\u624b\u9053",
			"298" : "SAT"
		}
	});
	var select = document.getElementById("courseName");
	select.options.length = 0;
	select.options[select.options.length] = new Option('--请选择--', '');
	for ( var name in list[val]) {
		select.options[select.options.length] = new Option(list[val][name],
				name);
	}
}